[Killed] LogicalOperator
main/components/Urls/UrlTable.jsx:62:5
   }
 
   const urlsForTable =
-    urls._embedded && urls._embedded.urls ? urls._embedded?.urls : [];
+    urls._embedded || urls._embedded.urls ? urls._embedded?.urls : [];
 
   return (
killedBy: UrlTable tests renders empty table correctly
statusReason: Cannot read properties of undefined (reading 'urls')

[Killed] ConditionalExpression
main/components/Urls/UrlTable.jsx:62:5
   }
 
   const urlsForTable =
-    urls._embedded && urls._embedded.urls ? urls._embedded?.urls : [];
+    true ? urls._embedded?.urls : [];
 
   return (
killedBy: UrlTable tests renders empty table correctly
statusReason: Cannot read properties of undefined (reading 'length')
