[Killed] LogicalOperator
src/main/components/OurTable.jsx:42:26
                 {header.isPlaceholder ? null : (
                   <div
                     // Add onClick handler for sorting if the column is sortable
-                    {...(header.column.getCanSort() && {
-                      onClick: header.column.getToggleSortingHandler(),
-                      style: { cursor: "pointer" }, // Add cursor style for visual cue
-                    })}
+                    {...(header.column.getCanSort() || {
+  onClick: header.column.getToggleSortingHandler(),
+  style: {
+    cursor: "pointer"
+  } // Add cursor style for visual cue
+})}
                     data-testid={`${testid}-header-${header.column.id}-sort-header`}
                   >
killedBy: OurTable tests click on a header and a sort caret should appear
statusReason: expect(element).toHaveStyle()

- Expected

- cursor: pointer;
