[Killed] BlockStatement
main/components/Urls/UrlTable.jsx:16:34
 }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/urls/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UrlTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/urls/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ArrayDeclaration
main/components/Urls/UrlTable.jsx:34:19
     deleteMutation.mutate(cell);
   };
 
-  const columns = [
-    {
-      header: "id",
-      accessorKey: "id", // accessor is the "key" in the data
-    },
-
-    {
-      header: "Url",
-      accessorKey: "url",
-    },
-    {
-      header: "Short Description",
-      accessorKey: "shortDescription",
-    },
-    {
-      header: "Long Description",
-      accessorKey: "longDescription",
-    },
-  ];
+  const columns = [];
 
   if (hasRole(currentUser, "ROLE_ADMIN")) {
killedBy: UrlTable tests renders empty table correctly
statusReason: Unable to find an element with the text: id. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UrlTable"

[Killed] ObjectLiteral
main/components/Urls/UrlTable.jsx:40:5
       accessorKey: "id", // accessor is the "key" in the data
     },
 
-    {
-      header: "Url",
-      accessorKey: "url",
-    },
+    {},
     {
       header: "Short Description",
killedBy: UrlTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Urls/UrlTable.jsx:41:15
     },
 
     {
-      header: "Url",
+      header: "",
       accessorKey: "url",
     },
killedBy: UrlTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Url. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UrlTable"

[Killed] ObjectLiteral
main/components/Urls/UrlTable.jsx:44:5
       header: "Url",
       accessorKey: "url",
     },
-    {
-      header: "Short Description",
-      accessorKey: "shortDescription",
-    },
+    {},
     {
       header: "Long Description",
killedBy: UrlTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Urls/UrlTable.jsx:48:5
       header: "Short Description",
       accessorKey: "shortDescription",
     },
-    {
-      header: "Long Description",
-      accessorKey: "longDescription",
-    },
+    {},
   ];
 
killedBy: UrlTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Urls/UrlTable.jsx:49:15
       accessorKey: "shortDescription",
     },
     {
-      header: "Long Description",
+      header: "",
       accessorKey: "longDescription",
     },
killedBy: UrlTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Long Description. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UrlTable"

[Killed] StringLiteral
main/components/Urls/UrlTable.jsx:50:20
     },
     {
       header: "Long Description",
-      accessorKey: "longDescription",
+      accessorKey: "",
     },
   ];
killedBy: UrlTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="UrlTable-cell-row-0-col-longDescription"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="UrlTable"
